In [91]:

# 리스트
a = [1, 2, 3, 4, 5]
a[2]   # 인덱싱
a[1:5]  # 슬라이싱

[2, 3, 4, 5]

In [92]:
import pandas as pd

df = pd.read_csv("./temp.csv")
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  1500   10
1   카페라떼  2000  110

In [93]:
# 인덱싱

df.loc[0]
df.loc[1]

메뉴     카페라떼
가격     2000
칼로리     110
Name: 1, dtype: object

In [94]:
df.loc[1,"가격"]

np.int64(2000)

In [95]:
# 슬라이싱
df.loc[0:7, "가격"]
df.loc[:, "가격"]

0    1500
1    2000
2    3000
3    2000
4    1500
5    3000
6    4000
Name: 가격, dtype: int64

In [96]:
df.loc[:, "가격":"칼로리"]

     가격  칼로리
0  1500   10
1  2000  110
2  3000  250
3  2000  110
4  1500   20
5  3000  210
6  4000    0

In [97]:
# 인덱싱 / 슬라이싱 (iloc)
df

      메뉴    가격  칼로리
0  아메리카노  1500   10
1   카페라떼  2000  110
2   카페모카  3000  250
3   카푸치노  2000  110
4  에스프레소  1500   20
5    밀크티  3000  210
6     녹차  4000    0

In [98]:
df.iloc[0]

메뉴     아메리카노
가격      1500
칼로리       10
Name: 0, dtype: object

In [99]:
df.iloc[:,2]

0     10
1    110
2    250
3    110
4     20
5    210
6      0
Name: 칼로리, dtype: int64

In [100]:
df.iloc[2, 1:3]

가격     3000
칼로리     250
Name: 2, dtype: object

In [101]:
# 데이터 추가/변경

import numpy as np

df["원산지"] = np

df

      메뉴    가격  칼로리                                                원산지
0  아메리카노  1500   10  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
1   카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
2   카페모카  3000  250  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
3   카푸치노  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
4  에스프레소  1500   20  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
5    밀크티  3000  210  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
6     녹차  4000    0  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...

In [102]:
# loc를 통해서 값 변경

df.loc[0, "원산지"] = "콜롬비아"
df.loc[2:5, "원산지"] = "과테말라"

df

      메뉴    가격  칼로리                                                원산지
0  아메리카노  1500   10                                               콜롬비아
1   카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
2   카페모카  3000  250                                               과테말라
3   카푸치노  2000  110                                               과테말라
4  에스프레소  1500   20                                               과테말라
5    밀크티  3000  210                                               과테말라
6     녹차  4000    0  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...

In [103]:
df.loc ["시즌"] = ["크리스마스 라떼", 6000, 500, "한국"]
df

          메뉴    가격  칼로리                                                원산지
0      아메리카노  1500   10                                               콜롬비아
1       카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
2       카페모카  3000  250                                               과테말라
3       카푸치노  2000  110                                               과테말라
4      에스프레소  1500   20                                               과테말라
5        밀크티  3000  210                                               과테말라
6         녹차  4000    0  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
시즌  크리스마스 라떼  6000  500                                                 한국

In [104]:
# loc와 딕셔너리를 활용한 값 추가

df.loc[7] = {"메뉴": "구미라떼", "가격":2000, "칼로리":20}
df

          메뉴    가격  칼로리                                                원산지
0      아메리카노  1500   10                                               콜롬비아
1       카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
2       카페모카  3000  250                                               과테말라
3       카푸치노  2000  110                                               과테말라
4      에스프레소  1500   20                                               과테말라
5        밀크티  3000  210                                               과테말라
6         녹차  4000    0  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
시즌  크리스마스 라떼  6000  500                                                 한국
7       구미라떼  2000   20                                                NaN

In [105]:
df.drop("시즌", axis=0, inplace=True)

In [106]:
df

      메뉴    가격  칼로리                                                원산지
0  아메리카노  1500   10                                               콜롬비아
1   카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
2   카페모카  3000  250                                               과테말라
3   카푸치노  2000  110                                               과테말라
4  에스프레소  1500   20                                               과테말라
5    밀크티  3000  210                                               과테말라
6     녹차  4000    0  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
7   구미라떼  2000   20                                                NaN

In [107]:
df.to_csv("cafe2.csv", index=False)

In [108]:
df.sort_index(ascending=False)

      메뉴    가격  칼로리                                                원산지
7   구미라떼  2000   20                                                NaN
6     녹차  4000    0  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
5    밀크티  3000  210                                               과테말라
4  에스프레소  1500   20                                               과테말라
3   카푸치노  2000  110                                               과테말라
2   카페모카  3000  250                                               과테말라
1   카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
0  아메리카노  1500   10                                               콜롬비아

In [109]:
df.sort_values(by="가격", ascending=False)

      메뉴    가격  칼로리                                                원산지
6     녹차  4000    0  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
2   카페모카  3000  250                                               과테말라
5    밀크티  3000  210                                               과테말라
1   카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
7   구미라떼  2000   20                                                NaN
3   카푸치노  2000  110                                               과테말라
0  아메리카노  1500   10                                               콜롬비아
4  에스프레소  1500   20                                               과테말라

In [110]:
df.sort_values("가격",ascending=True)
df

      메뉴    가격  칼로리                                                원산지
0  아메리카노  1500   10                                               콜롬비아
1   카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
2   카페모카  3000  250                                               과테말라
3   카푸치노  2000  110                                               과테말라
4  에스프레소  1500   20                                               과테말라
5    밀크티  3000  210                                               과테말라
6     녹차  4000    0  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
7   구미라떼  2000   20                                                NaN

In [111]:
df.sort_values("메뉴", ascending=False, inplace=True)
df

      메뉴    가격  칼로리                                                원산지
3   카푸치노  2000  110                                               과테말라
2   카페모카  3000  250                                               과테말라
1   카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
4  에스프레소  1500   20                                               과테말라
0  아메리카노  1500   10                                               콜롬비아
5    밀크티  3000  210                                               과테말라
6     녹차  4000    0  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
7   구미라떼  2000   20                                                NaN

In [112]:
df.sort_values(["가격","메뉴"], ascending=[True, False], inplace=True)
df

      메뉴    가격  칼로리                                                원산지
4  에스프레소  1500   20                                               과테말라
0  아메리카노  1500   10                                               콜롬비아
3   카푸치노  2000  110                                               과테말라
1   카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
7   구미라떼  2000   20                                                NaN
2   카페모카  3000  250                                               과테말라
5    밀크티  3000  210                                               과테말라
6     녹차  4000    0  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...

In [114]:
# 인덱스 초기화
df.reset_index(drop=True)

      메뉴    가격  칼로리                                                원산지
0  에스프레소  1500   20                                               과테말라
1  아메리카노  1500   10                                               콜롬비아
2   카푸치노  2000  110                                               과테말라
3   카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
4   구미라떼  2000   20                                                NaN
5   카페모카  3000  250                                               과테말라
6    밀크티  3000  210                                               과테말라
7     녹차  4000    0  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...

In [ ]:
## 필터링

df=pd.read_csv("cafe2.csv")
df

      메뉴    가격  칼로리                                                원산지
0  아메리카노  1500   10                                               콜롬비아
1   카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
2   카페모카  3000  250                                               과테말라
3   카푸치노  2000  110                                               과테말라
4  에스프레소  1500   20                                               과테말라
5    밀크티  3000  210                                               과테말라
6     녹차  4000    0  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
7   구미라떼  2000   20                                                NaN

In [115]:
 cond = df["칼로리"] == 20
 df

      메뉴    가격  칼로리                                                원산지
4  에스프레소  1500   20                                               과테말라
0  아메리카노  1500   10                                               콜롬비아
3   카푸치노  2000  110                                               과테말라
1   카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
7   구미라떼  2000   20                                                NaN
2   카페모카  3000  250                                               과테말라
5    밀크티  3000  210                                               과테말라
6     녹차  4000    0  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...

In [ ]:
df[cond]

      메뉴    가격  칼로리   원산지
4  에스프레소  1500   20  과테말라
7   구미라떼  2000   20   NaN

In [ ]:
df[df["원산지"] == "과테말라"]

      메뉴    가격  칼로리   원산지
2   카페모카  3000  250  과테말라
3   카푸치노  2000  110  과테말라
4  에스프레소  1500   20  과테말라
5    밀크티  3000  210  과테말라

In [ ]:
# 문제. 칼로리가 200 이하이면서 가격이 5000원 이상인 메뉴를 필터링 하세요.

cond = (df["칼로리"] <= 200) & (df["가격"] >=2000)
df[cond]

     메뉴    가격  칼로리                                                원산지
1  카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
3  카푸치노  2000  110                                               과테말라
6    녹차  4000    0  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
7  구미라떼  2000   20                                                NaN

In [ ]:
# Not 연산자
cond = df["칼로리"] <50
df[~cond]

     메뉴    가격  칼로리                                                원산지
1  카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
2  카페모카  3000  250                                               과테말라
3  카푸치노  2000  110                                               과테말라
5   밀크티  3000  210                                               과테말라

In [ ]:
# 복수 조건 필터링
cond1 = df["가격"] > 5000
cond2 = df["칼로리"] >100

df[cond1 | cond2]

     메뉴    가격  칼로리                                                원산지
1  카페라떼  2000  110  <module 'numpy' from 'c:\\Users\\krcea\\AppDat...
2  카페모카  3000  250                                               과테말라
3  카푸치노  2000  110                                               과테말라
5   밀크티  3000  210                                               과테말라